import random

# Список из 30 типичных имен студентов
names = [
    "Александр", "Мария", "Дмитрий", "Анна", "Сергей",
    "Екатерина", "Алексей", "Ольга", "Иван", "Елена",
    "Николай", "Татьяна", "Кирилл", "Юлия", "Роман",
    "Тимур", "Виктория", "Максим", "Дарья", "Павел",
    "Светлана", "Артем", "Полина", "Денис", "Анастасия",
    "Евгений", "Маргарита", "Игорь", "Ксения", "Станислав",
    "Кристина"
]

while True:
    user_input = input("Введите количество строк для вывода (или нажмите Enter для выхода): ")
    if user_input == "":
        print("Выход из программы.")
        break

    try:
        n = int(user_input)
        if n <= 0:
            print("Введите положительное число до 30 или ENTER для выхода.")
            continue

        # Генерация n случайных имен
        random_names = random.sample(names, min(n, len(names)))
        print("Сегодня отвечают:")
        for name in random_names:
            print(name)

    except ValueError:
        print("Введите корректное число отвечющих .")